# 강의

In [43]:
%who

d	 df	 pd	 s

==================================================================================

# Pandas

R의 데이터프레임(data.frame)과 같은 형식으로 데이터를 다룰 수 있게 해주는 라이브러리

Series는 R의 vector와, DataFrame은 R의 data.frame과 유사

pandas.pydata.org

In [2]:
import pandas as pd

## series

In [3]:
s = pd.Series([1,2,3,4,5]) # R에서는 list라고 말함

In [4]:
s

0    1
1    2
2    3
3    4
4    5
dtype: int64

In [5]:
s[0]

1

In [6]:
s[2:5]

2    3
3    4
4    5
dtype: int64

In [7]:
s % 2 == 0

0    False
1     True
2    False
3     True
4    False
dtype: bool

In [8]:
s - 2 == 0

0    False
1     True
2    False
3    False
4    False
dtype: bool

### 조건에 맞는 값만 가져오기

In [9]:
s[s % 2 == 0]

1    2
3    4
dtype: int64

## 날짜 다루기

In [17]:
d = pd.date_range('20170829', periods=5)

In [18]:
d

DatetimeIndex(['2017-08-29', '2017-08-30', '2017-08-31', '2017-09-01',
               '2017-09-02'],
              dtype='datetime64[ns]', freq='D')

In [19]:
pd.date_range('20170829', periods=5, freq='2MS')

DatetimeIndex(['2017-09-01', '2017-11-01', '2018-01-01', '2018-03-01',
               '2018-05-01'],
              dtype='datetime64[ns]', freq='2MS')

In [20]:
pd.date_range('20170829', periods=5, freq='2MS') + pd.DateOffset(days=10)

DatetimeIndex(['2017-09-11', '2017-11-11', '2018-01-11', '2018-03-11',
               '2018-05-11'],
              dtype='datetime64[ns]', freq=None)

실습 : 5개월 간 매달 15일

In [21]:
pd.date_range('20171014', periods=5, freq='1MS') + pd.DateOffset(days=14)

DatetimeIndex(['2017-11-15', '2017-12-15', '2018-01-15', '2018-02-15',
               '2018-03-15'],
              dtype='datetime64[ns]', freq=None)

In [22]:
pd.date_range('20171014', periods=5, freq='1MS') + pd.DateOffset(days=-1)

DatetimeIndex(['2017-10-31', '2017-11-30', '2017-12-31', '2018-01-31',
               '2018-02-28'],
              dtype='datetime64[ns]', freq='M')

In [23]:
pd.to_datetime('today')

Timestamp('2017-10-14 00:00:00')

In [24]:
pd.to_datetime('today') + pd.DateOffset(days=-1)

Timestamp('2017-10-13 00:00:00')

In [25]:
pd.to_datetime('20171013')

Timestamp('2017-10-13 00:00:00')

## DataFrame

In [34]:
df = pd.DataFrame({'date': d, 'num': s})

In [35]:
df

        date  num
0 2017-08-29    1
1 2017-08-30    2
2 2017-08-31    3
3 2017-09-01    4
4 2017-09-02    5

In [36]:
df.head(3)

        date  num
0 2017-08-29    1
1 2017-08-30    2
2 2017-08-31    3

In [37]:
df.tail(3)

        date  num
2 2017-08-31    3
3 2017-09-01    4
4 2017-09-02    5

In [38]:
df.columns

Index(['date', 'num'], dtype='object')

In [39]:
df.index

RangeIndex(start=0, stop=5, step=1)

In [40]:
df.values

array([[Timestamp('2017-08-29 00:00:00'), 1],
       [Timestamp('2017-08-30 00:00:00'), 2],
       [Timestamp('2017-08-31 00:00:00'), 3],
       [Timestamp('2017-09-01 00:00:00'), 4],
       [Timestamp('2017-09-02 00:00:00'), 5]], dtype=object)

In [41]:
df.dtypes

date    datetime64[ns]
num              int64
dtype: object

## DataFrame 만드는 방법

In [22]:
d1 = pd.DataFrame(
    [
        {'A': 1, 'B': 2},
        {'A': 3, 'B': 4}
    ])

In [23]:
d1

   A  B
0  1  2
1  3  4

## 열이름, 행이름 바꾸기

In [45]:
df.columns = ['날짜', '번호']

In [46]:
df

          날짜  번호
0 2017-08-29   1
1 2017-08-30   2
2 2017-08-31   3
3 2017-09-01   4
4 2017-09-02   5

In [47]:
df.index = ['A','B','C','D','E']

In [48]:
df

          날짜  번호
A 2017-08-29   1
B 2017-08-30   2
C 2017-08-31   3
D 2017-09-01   4
E 2017-09-02   5

In [49]:
df.set_index('날짜')

            번호
날짜
2017-08-29   1
2017-08-30   2
2017-08-31   3
2017-09-01   4
2017-09-02   5

In [50]:
df.sort_values(by='날짜', ascending=False) #내림차순

          날짜  번호
E 2017-09-02   5
D 2017-09-01   4
C 2017-08-31   3
B 2017-08-30   2
A 2017-08-29   1

In [51]:
df['날짜']

A   2017-08-29
B   2017-08-30
C   2017-08-31
D   2017-09-01
E   2017-09-02
Name: 날짜, dtype: datetime64[ns]

In [52]:
df[['번호', '날짜']]

   번호         날짜
A   1 2017-08-29
B   2 2017-08-30
C   3 2017-08-31
D   4 2017-09-01
E   5 2017-09-02

## 행 선택

In [53]:
df.loc['A']

날짜    2017-08-29 00:00:00
번호                      1
Name: A, dtype: object

In [54]:
df.loc[['A', 'B']]

          날짜  번호
A 2017-08-29   1
B 2017-08-30   2

In [35]:
df.loc['A':'C']

          날짜  번호
A 2017-08-29   1
B 2017-08-30   2
C 2017-08-31   3

In [36]:
df.loc['A', '날짜']

Timestamp('2017-08-29 00:00:00')

In [37]:
df.at['A', '날짜']  # 하나의 값에 접근할 때는 .at이 더 빠름

Timestamp('2017-08-29 00:00:00')

In [55]:
%%timeit
df.at['A', '날짜']

The slowest run took 11.27 times longer than the fastest. This could mean that an intermediate result is being cached.
10000 loops, best of 3: 33.6 µs per loop

In [56]:
%%timeit
df.loc['A', '날짜']

10000 loops, best of 3: 59.2 µs per loop

In [40]:
df.iloc[0]

날짜    2017-08-29 00:00:00
번호                      1
Name: A, dtype: object

In [41]:
df.iloc[0,0]

Timestamp('2017-08-29 00:00:00')

In [42]:
df.iat[0,0]

Timestamp('2017-08-29 00:00:00')

## 가장 큰/작은 값의 위치

In [43]:
df['번호'].idxmin()

'A'

In [44]:
df['번호'].idxmax()

'E'

### Boolean Indexing

In [45]:
df[df['날짜'] > pd.Timestamp('2017-08-31')]

          날짜  번호
D 2017-09-01   4
E 2017-09-02   5

#### OR

OR는 |로 나타냄

Python에서 |는 부등호보다 먼저 계산되기 때문에 괄호를 해줌

(df['날짜'] < pd.Timestamp('2017-09-02')) | (df['번호'] < 4)

#### AND

AND는 &로 나타냄

역시 괄호가 필요

In [48]:
(df['날짜'] < pd.Timestamp('2017-09-02')) & (df['번호'] < 4)

A     True
B     True
C     True
D    False
E    False
dtype: bool

#### NOT

NOT은 ~로 나타냄

In [49]:
~(df['날짜'] < pd.Timestamp('2017-09-02'))

A    False
B    False
C    False
D    False
E     True
Name: 날짜, dtype: bool

#### 포함관계

In [50]:
df['번호'].isin([1, 3, 5])

A     True
B    False
C     True
D    False
E     True
Name: 번호, dtype: bool

## 데이터 프레임 복사

In [51]:
df2 = df.copy()

## 데이터 추가

In [52]:
df['고객'] = [300, 240, 150, 400, 340]

In [53]:
df

          날짜  번호   고객
A 2017-08-29   1  300
B 2017-08-30   2  240
C 2017-08-31   3  150
D 2017-09-01   4  400
E 2017-09-02   5  340

## 데이터 변경

In [54]:
df.iat[2, 2] = 10

In [55]:
df

          날짜  번호   고객
A 2017-08-29   1  300
B 2017-08-30   2  240
C 2017-08-31   3   10
D 2017-09-01   4  400
E 2017-09-02   5  340

In [56]:
df2.loc[df['번호'] > 2, '고객'] = 0

In [57]:
df2

          날짜  번호   고객
A 2017-08-29   1  NaN
B 2017-08-30   2  NaN
C 2017-08-31   3  0.0
D 2017-09-01   4  0.0
E 2017-09-02   5  0.0

In [58]:
df2.loc[df['번호'] < 4, ['고객', '번호']] = -1

In [59]:
df2

          날짜  번호   고객
A 2017-08-29  -1 -1.0
B 2017-08-30  -1 -1.0
C 2017-08-31  -1 -1.0
D 2017-09-01   4  0.0
E 2017-09-02   5  0.0

## 조건에 따라 다른 값 매기기

In [60]:
import numpy as np

In [61]:
np.where(df['날짜'] > pd.Timestamp('2017-08-31'), '미래', '과거')

array(['과거', '과거', '과거', '미래', '미래'],
      dtype='<U2')

## csv 파일 읽기

In [63]:
air = pd.read_csv('C:/Users/STANDARD/Desktop/Python_U/data/product_airtime.csv')

In [64]:
air.head()

,PRODUCT_NBR,ONAIR_DATE,ONAIR_START_TMS,ONAIR_END_TMS,ONAIR_MINS,HOST1,HOST2
0,P150028635,2015-01-02,2015-01-02 01:33:02,2015-01-02 01:58:20,25.32,NaN,NaN
1,P150028635,2015-01-02,2015-01-02 01:21:14,2015-01-02 01:32:48,11.58,NaN,NaN
2,P150028635,2015-01-01,2015-01-01 22:34:30,2015-01-01 22:58:17,23.80,NaN,NaN
3,P150028635,2015-01-01,2015-01-01 22:00:05,2015-01-01 22:33:02,32.97,NaN,NaN
4,P150028635,2015-01-01,2015-01-01 19:00:00,2015-01-01 19:00:01,0.03,NaN,NaN

## 실습

product_airtime.csv를 엑셀(.xlsx)로 변환한 다음 열어봅시다

product_airtime.csv를 탭으로 구분한 형식(.tsv)로 변환한 다음 열어봅시다

In [65]:
air.shape

(63468, 7)

## 컬럼 통계

In [66]:
air['ONAIR_MINS'].sum()

240808.89999999999

In [67]:
air['ONAIR_MINS'].mean()

3.7941781685258711

In [68]:
air['ONAIR_MINS'].std()

5.1647709418247665

In [69]:
air['ONAIR_MINS'].min()

0.02

In [70]:
air['ONAIR_MINS'].max()

59.5

## 필터링

In [71]:
m = air['ONAIR_MINS'].mean()
s = air['ONAIR_MINS'].std()

air[air['ONAIR_MINS'] > m + 10 * s]

,PRODUCT_NBR,ONAIR_DATE,ONAIR_START_TMS,ONAIR_END_TMS,ONAIR_MINS,HOST1,HOST2
1039,P150028603,2015-01-01,2015-01-01 08:01:29,2015-01-01 08:57:35,56.12,NaN,NaN
3532,P150028674,2015-02-15,2015-02-15 12:00:00,2015-02-15 12:58:04,58.08,NaN,NaN
6742,P150062392,2015-01-05,2015-01-05 00:01:21,2015-01-05 00:58:48,57.47,NaN,NaN
6743,P150062392,2015-01-04,2015-01-04 22:00:42,2015-01-04 22:58:56,58.25,NaN,NaN
6745,P150062392,2015-01-04,2015-01-04 20:00:47,2015-01-04 20:59:59,59.22,NaN,NaN
6755,P150062392,2015-01-04,2015-01-04 12:00:43,2015-01-04 12:58:42,58.00,NaN,NaN
6764,P150062392,2015-01-04,2015-01-04 21:01:20,2015-01-04 21:58:49,57.50,Wheeler Dan,NaN
6766,P150062392,2015-01-04,2015-01-04 18:02:04,2015-01-04 18:59:59,57.93,Bauer Jill,NaN
6767,P150062392,2015-01-04,2015-01-04 16:00:03,2015-01-04 16:59:32,59.50,Bauer Jill,NaN
6775,P150062392,2015-01-04,2015-01-04 09:00:43,2015-01-04 09:58:42,58.00,Hughes Dan,NaN
9458,P150033993,2015-01-10,2015-01-10 14:00:00,2015-01-10 14:59:06,59.12,Bauer Jill,NaN
11151,P150062049,2015-03-14,2015-03-14 05:01:25,2015-03-14 05:59:40,58.27,NaN,NaN
11152,P150062049,2015-03-12,2015-03-12 18:00:15,2015-03-12 18:58:30,58.27,NaN,NaN
11658,P150028449,2015-01-11,2015-01-11 11:02:34,2015-01-11 11:59:59,57.43,NaN,NaN
11661,P150028449,2015-01-11,2015-01-11 02:00:00,2015-01-11 02:58:16,58.28,NaN,NaN
11666,P150028449,2015-01-10,2015-01-10 22:00:57,2015-01-10 22:59:31,58.58,Killinger Shawn,NaN
11738,P150025508,2015-01-11,2015-01-11 18:02:12,2015-01-11 18:59:08,56.95,NaN,NaN
11858,P150028599,2015-03-15,2015-03-15 15:02:04,2015-03-15 15:59:42,57.65,NaN,NaN
11861,P150028599,2015-03-15,2015-03-15 10:02:05,2015-03-15 10:59:45,57.68,NaN,NaN
11867,P150028599,2015-03-15,2015-03-15 07:02:05,2015-03-15 07:59:45,57.68,Stauffer Stacey,NaN
13518,P150067222,2015-03-19,2015-03-19 20:00:49,2015-03-19 20:58:16,57.47,NaN,NaN
13585,P150067310,2015-03-03,2015-03-03 09:00:54,2015-03-03 09:58:33,57.67,NaN,NaN
13586,P150067310,2015-03-03,2015-03-03 06:00:54,2015-03-03 06:58:34,57.68,Hughes Dan,NaN
15026,P150062089,2015-03-15,2015-03-15 05:00:51,2015-03-15 05:59:12,58.37,NaN,NaN
15030,P150062089,2015-03-13,2015-03-13 16:00:33,2015-03-13 16:58:54,58.37,NaN,NaN
15031,P150062089,2015-03-13,2015-03-13 08:00:00,2015-03-13 08:57:42,57.72,NaN,NaN
15033,P150062089,2015-02-18,2015-02-18 14:00:00,2015-02-18 14:57:52,57.88,NaN,NaN
15036,P150062089,2015-02-23,2015-02-23 18:00:11,2015-02-23 18:58:31,58.35,NaN,NaN
15037,P150062089,2015-02-23,2015-02-23 00:02:16,2015-02-23 00:59:39,57.40,NaN,NaN
15050,P150062089,2015-02-20,2015-02-20 05:01:49,2015-02-20 05:59:59,58.18,NaN,NaN
...,...,...,...,...,...,...,...
38857,P150033891,2015-03-18,2015-03-18 21:00:22,2015-03-18 21:59:43,59.37,NaN,NaN
38859,P150033891,2015-03-16,2015-03-16 20:00:44,2015-03-16 20:59:59,59.27,NaN,NaN
38860,P150033891,2015-03-15,2015-03-15 09:00:37,2015-03-15 09:59:58,59.37,NaN,NaN
38862,P150033891,2015-03-15,2015-03-15 04:00:56,2015-03-15 04:59:59,59.07,NaN,NaN
38863,P150033891,2015-03-15,2015-03-15 19:00:00,2015-03-15 19:58:39,58.67,Gonzales Jacque,NaN
38866,P150033891,2015-03-15,2015-03-15 01:00:55,2015-03-15 01:59:59,59.08,Popaj Alberti,NaN
41311,P150062342,2015-02-15,2015-02-15 01:00:04,2015-02-15 01:58:57,58.90,NaN,NaN
41318,P150062342,2015-02-14,2015-02-14 22:00:04,2015-02-14 22:58:56,58.88,Domeier Rick,NaN
41321,P150062342,2015-02-13,2015-02-13 22:00:54,2015-02-13 22:59:02,58.15,NaN,NaN
41322,P150062342,2015-02-13,2015-02-13 19:00:54,2015-02-13 19:59:02,58.15,Gracie Carolyn,NaN
41478,P150067291,2015-03-15,2015-03-15 06:00:32,2015-03-15 06:58:21,57.83,Stauffer Stacey,NaN
41495,P150067291,2015-02-14,2015-02-14 13:01:22,2015-02-14 13:58:23,57.03,NaN,NaN
41520,P150067291,2015-02-14,2015-02-14 06:00:25,2015-02-14 06:57:28,57.07,Boesing Rachel,NaN
49943,P150067245,2015-02-28,2015-02-28 18:01:27,2015-02-28 18:58:26,57.00,NaN,NaN
49970,P150067245,2015-02-28,2015-02-28 14:01:32,2015-02-28 14:58:31,57.00,Killinger Shawn,NaN
52080,P150018305,2015-03-02,2015-03-02 18:01:25,2015-03-02 18:58:49,57.42,Rudolph TreacyJane,NaN
55860,P150062428,2015-03-11,2015-03-11 08:00:26,2015-03-11 08:59:16,58.85,Hughes Dan,NaN
55865,P150062428,2015-03-11,2015-03-11 00:00:21,2015-03-11 00:59:46,59.43,Domeier Rick,NaN
55870,P150062428,2015-03-11,2015-03-11 19:01:26,2015-03-11 19:59:19,57.90,Bauer Jill,NaN
55871,P150062428,2015-03-11,2015-03-11 00:00:20,2015-03-11 00:59:45,59.43,NaN,NaN
55876,P150062428,2015-03-11,2015-03-11 03:00:20,2015-03-11 03:59:45,59.43,NaN,NaN
55883,P150062428,2015-03-11,2015-03-11 11:00:25,2015-03-11 11:59:16,58.87,NaN,NaN
59015,P150062409,2015-03-22,2015-03-22 15:00:00,2015-03-22 15:58:10,58.18,NaN,NaN
59017,P150062409,2015-03-22,2015-03-22 12:02:36,2015-03-22 12:58:11,55.60,NaN,NaN
59018,P150062409,2015-03-22,2015-03-22 09:02:00,2015-03-22 09:59:24,57.42,NaN,NaN
59022,P150062409,2015-03-22,2015-03-22 03:00:22,2015-03-22 03:59:09,58.80,NaN,NaN
59029,P150062409,2015-03-22,2015-03-22 20:01:11,2015-03-22 20:58:24,57.23,Gracie Carolyn,NaN
59037,P150062409,2015-03-22,2015-03-22 11:02:36,2015-03-22 11:58:11,55.60,RoeMary Beth,NaN
59038,P150062409,2015-03-22,2015-03-22 08:02:00,2015-03-22 08:59:24,57.42,RoeMary Beth,NaN
59042,P150062409,2015-03-22,2015-03-22 00:00:21,2015-03-22 00:59:08,58.80,Domeier Rick,NaN

## DB에서 불러오기

In [72]:
from sqlalchemy import create_engine

In [73]:
engine = create_engine('sqlite:///example.db')

In [74]:
conn = engine.connect()

In [75]:
conn.execute('CREATE TABLE stocks (date text, price real)')

In [76]:
conn.execute("INSERT INTO stocks (date, price) VALUES ('2017-08-01', 1000)")

In [77]:
conn.execute("INSERT INTO stocks (date, price) VALUES ('2017-08-02', 2000)")

In [78]:
pd.read_sql('SELECT * from stocks', conn)

         date   price
0  2017-08-01  1000.0
1  2017-08-02  2000.0